number_1: int = int(input('Введите первое целое число: '))
number_2: int = int(input('Введите второе целое число: '))
number_3: int = int(input('Введите третье целое число: '))

# if number_1 > number_2:
#     maximum = number_1
#     print('Наибольшее число:', maximum)
# else:
#     maximum = number_2
#     print('Наибольшее число:', maximum)
# if number_3 > maximum:
#     maximum = number_3
#     print('Наибольшее число:', maximum)
# else:
#     if number_1 == number_2 == number_3:
#         print('Все числа равны')

"""
Число_1
Число_2
Число_3

Если Число_1 БОЛЬШЕ Число_2 И Число_1 БОЛЬШЕ Число_3
    Наибольшее число Число_1

Иначе если Число_2 БОЛЬШЕ Число_3
    Наибольшее число Число_2

Иначе если Число_3 БОЛЬШЕ Число_2
    Наибольшее число Число_3

Иначе
    Все числа равны
"""
